ir_version: 4
producer_name: "backend-test"
graph {
  node {
    output: "Func_MeanVarianceNormalization0x559bca4ffa40Exponent"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        float_data: 2
      }
      type: TENSOR
    }
  }
  node {
    output: "Func_MeanVarianceNormalization0x559bca4ffa40Epsilon"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        float_data: 9.9999997171806854e-10
      }
      type: TENSOR
    }
  }
  node {
    input: "X"
    output: "Func_MeanVarianceNormalization0x559bca4ffa40X_RM"
    op_type: "ReduceMean"
	attribute {
      name: "axes"
      ints: 0
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "Func_MeanVarianceNormalization0x559bca4ffa40X_RM"
    input: "Func_MeanVarianceNormalization0x559bca4ffa40Exponent"
    output: "Func_MeanVarianceNormalization0x559bca4ffa40EX_squared"
    op_type: "Pow"
  }
  node {
    input: "X"
    input: "Func_MeanVarianceNormalization0x559bca4ffa40Exponent"
    output: "Func_MeanVarianceNormalization0x559bca4ffa40X_squared"
    op_type: "Pow"
  }
  node {
    input: "Func_MeanVarianceNormalization0x559bca4ffa40X_squared"
    output: "Func_MeanVarianceNormalization0x559bca4ffa40E_Xsquared"
    op_type: "ReduceMean"
	attribute {
      name: "axes"
      ints: 0
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "Func_MeanVarianceNormalization0x559bca4ffa40E_Xsquared"
    input: "Func_MeanVarianceNormalization0x559bca4ffa40EX_squared"
    output: "Func_MeanVarianceNormalization0x559bca4ffa40Variance"
    op_type: "Sub"
  }
  node {
    input: "Func_MeanVarianceNormalization0x559bca4ffa40Variance"
    output: "Func_MeanVarianceNormalization0x559bca4ffa40STD"
    op_type: "Sqrt"
  }
  node {
    input: "X"
    input: "Func_MeanVarianceNormalization0x559bca4ffa40X_RM"
    output: "Func_MeanVarianceNormalization0x559bca4ffa40X_variance"
    op_type: "Sub"
  }
  node {
    input: "Func_MeanVarianceNormalization0x559bca4ffa40STD"
    input: "Func_MeanVarianceNormalization0x559bca4ffa40Epsilon"
    output: "Func_MeanVarianceNormalization0x559bca4ffa40Processed_STD"
    op_type: "Add"
  }
  node {
    input: "Func_MeanVarianceNormalization0x559bca4ffa40X_variance"
    input: "Func_MeanVarianceNormalization0x559bca4ffa40Processed_STD"
    output: "Y"
    op_type: "Div"
  }
  name: "test_mvn"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
