ir_version: 5
producer_name: "nGraph ONNX Importer"
graph {
  node {
    input: "x"
    input: "y_scale"
    input: "y_zero_point"
    output: "y"
    op_type: "QuantizeLinear"
  }
  name: "test_quantizelinear"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "y_scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "y_zero_point"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
