ir_version: 10
graph {
  node {
    input: "data"
    input: "starts"
    input: "ends"
    input: "axes"
    input: "steps"
    output: "Y"
    name: "node1"
    op_type: "Slice"
    doc_string: "Slice"
  }
  name: "Slice"
  doc_string: ""
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim { 
            dim_value: 1
          }
          dim {
            dim_value:2 
          }
          dim {
            dim_value:4
          }
        }
      }
    }
  }
  input {
    name: "starts"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "ends"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "axes"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "steps"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim { 
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 10
}
