ir_version: 3
producer_name: "nGraph ONNX Importer"
graph {
  node {
    input: "x"
    output: "y"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1000
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 1000
      type: INTS
    }
  }
  name: "test_slice_start_out_of_bounds"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 0
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 8
}
